# merge() is used to combine two DataFrames based on common columns or common index values.

In [2]:
import pandas as pd 

# dataset_1
dataset_1 = pd.DataFrame({
    "Name"  : ['yash','tanya','tushi','mohit'],
    "age"   : [21,20,18,25],   # keep numbers, not strings
    "salary":[100000,10000,20000,150],
    "work"  : ['data science','sales executive','accounted','swiper']
})

# dataset_2
dataset_2 = pd.DataFrame({
    "Name"  : ['yash','yash vardhan','tanya','tushi','mohit','monu','shinchan','nobitha','doremone'],
    "age"   : [21,23,20,18,25,26,45,22,30],
    "salary":[101000,100000,10000,20000,150,12000,15000,25000,30000],
    "work"  : ['data science','data analyst','sales executive','accounted','swiper','hardware Engineering',
               'maneger','bank maneger','scientest']   
})

# merging the two data set 
df = pd.merge(dataset_1, dataset_2, on='age', how="inner")
# inner functuion sowing only common data in the both data set 

print("Inner Join function in the merging :-")
print(df)

Inner Join function in the merging :-
  Name_x  age  salary_x           work_x Name_y  salary_y           work_y
0   yash   21    100000     data science   yash    101000     data science
1  tanya   20     10000  sales executive  tanya     10000  sales executive
2  tushi   18     20000        accounted  tushi     20000        accounted
3  mohit   25       150           swiper  mohit       150           swiper

In [7]:
data = pd.merge(dataset_1,dataset_2, on ='age' , how = 'outer')
print(data)

  Name_x  age  salary_x           work_x        Name_y  salary_y  \
0  tushi   18   20000.0        accounted         tushi     20000
1  tanya   20   10000.0  sales executive         tanya     10000
2   yash   21  100000.0     data science          yash    101000
3    NaN   22       NaN              NaN       nobitha     25000
4    NaN   23       NaN              NaN  yash vardhan    100000
5  mohit   25     150.0           swiper         mohit       150
6    NaN   26       NaN              NaN          monu     12000
7    NaN   30       NaN              NaN      doremone     30000
8    NaN   45       NaN              NaN      shinchan     15000

                 work_y
0             accounted
1       sales executive
2          data science
3          bank maneger
4          data analyst
5                swiper
6  hardware Engineering
7             scientest
8               maneger

In [10]:
print(pd.merge(dataset_1,dataset_2,on = 'age',how = 'left'))

  Name_x  age  salary_x           work_x Name_y  salary_y           work_y
0   yash   21    100000     data science   yash    101000     data science
1  tanya   20     10000  sales executive  tanya     10000  sales executive
2  tushi   18     20000        accounted  tushi     20000        accounted
3  mohit   25       150           swiper  mohit       150           swiper

In [12]:
print(pd.merge(dataset_1,dataset_2, on = 'age', how = 'right'))

  Name_x  age  salary_x           work_x        Name_y  salary_y  \
0   yash   21  100000.0     data science          yash    101000
1    NaN   23       NaN              NaN  yash vardhan    100000
2  tanya   20   10000.0  sales executive         tanya     10000
3  tushi   18   20000.0        accounted         tushi     20000
4  mohit   25     150.0           swiper         mohit       150
5    NaN   26       NaN              NaN          monu     12000
6    NaN   45       NaN              NaN      shinchan     15000
7    NaN   22       NaN              NaN       nobitha     25000
8    NaN   30       NaN              NaN      doremone     30000

                 work_y
0          data science
1          data analyst
2       sales executive
3             accounted
4                swiper
5  hardware Engineering
6               maneger
7          bank maneger
8             scientest

# they showing m*n = data 
* cross joint
* where m is ds1 or n is ds2

In [14]:
dataset_1 = pd.DataFrame({
    "Name"  : ['yash','tanya','tushi','mohit'],
    "age"   : [21,20,18,25],   # keep numbers, not strings
    "salary":[100000,10000,20000,150],
    "work"  : ['data science','sales executive','accounted','swiper']
})

# dataset_2
dataset_2 = pd.DataFrame({
    "Name"  : ['yash','yash vardhan','tanya','tushi','mohit','monu','shinchan','nobitha','doremone'],
    "age"   : [21,23,20,18,25,26,45,22,30],
    "salary":[101000,100000,10000,20000,150,12000,15000,25000,30000],
    "work"  : ['data science','data analyst','sales executive','accounted','swiper','hardware Engineering',
               'maneger','bank maneger','scientest']   
})
df = pd.merge(dataset_1,dataset_2, how = "cross")
print(df)

   Name_x  age_x  salary_x           work_x        Name_y  age_y  salary_y  \
0    yash     21    100000     data science          yash     21    101000
1    yash     21    100000     data science  yash vardhan     23    100000
2    yash     21    100000     data science         tanya     20     10000
3    yash     21    100000     data science         tushi     18     20000
4    yash     21    100000     data science         mohit     25       150
5    yash     21    100000     data science          monu     26     12000
6    yash     21    100000     data science      shinchan     45     15000
7    yash     21    100000     data science       nobitha     22     25000
8    yash     21    100000     data science      doremone     30     30000
9   tanya     20     10000  sales executive          yash     21    101000
10  tanya     20     10000  sales executive  yash vardhan     23    100000
11  tanya     20     10000  sales executive         tanya     20     10000
12  tanya     20     10000  sales executive         tushi     18     20000
13  tanya     20     10000  sales executive         mohit     25       150
14  tanya     20     10000  sales executive          monu     26     12000
15  tanya     20     10000  sales executive      shinchan     45     15000
16  tanya     20     10000  sales executive       nobitha     22     25000
17  tanya     20     10000  sales executive      doremone     30     30000
18  tushi     18     20000        accounted          yash     21    101000
19  tushi     18     20000        accounted  yash vardhan     23    100000
20  tushi     18     20000        accounted         tanya     20     10000
21  tushi     18     20000        accounted         tushi     18     20000
22  tushi     18     20000        accounted         mohit     25       150
23  tushi     18     20000        accounted          monu     26     12000
24  tushi     18     20000        accounted      shinchan     45     15000
25  tushi     18     20000        accounted       nobitha     22     25000
26  tushi     18     20000        accounted      doremone     30     30000
27  mohit     25       150           swiper          yash     21    101000
28  mohit     25       150           swiper  yash vardhan     23    100000
29  mohit     25       150           swiper         tanya     20     10000
30  mohit     25       150           swiper         tushi     18     20000
31  mohit     25       150           swiper         mohit     25       150
32  mohit     25       150           swiper          monu     26     12000
33  mohit     25       150           swiper      shinchan     45     15000
34  mohit     25       150           swiper       nobitha     22     25000
35  mohit     25       150           swiper      doremone     30     30000

                  work_y
0           data science
1           data analyst
2        sales executive
3              accounted
4                 swiper
5   hardware Engineering
6                maneger
7           bank maneger
8              scientest
9           data science
10          data analyst
11       sales executive
12             accounted
13                swiper
14  hardware Engineering
15               maneger
16          bank maneger
17             scientest
18          data science
19          data analyst
20       sales executive
21             accounted
22                swiper
23  hardware Engineering
24               maneger
25          bank maneger
26             scientest
27          data science
28          data analyst
29       sales executive
30             accounted
31                swiper
32  hardware Engineering
33               maneger
34          bank maneger
35             scientest

# join() is used to combine two DataFrames using their index.

In [16]:
ds1 = pd.DataFrame({'a':[1,2,3,4],'b':[6,5,49,8]})
ds2 = pd.DataFrame({'c':[1,2,3,4],'d':[6,5,49,8]})
ds1.join(ds2)

   a   b  c   d
0  1   6  1   6
1  2   5  2   5
2  3  49  3  49
3  4   8  4   8

In [17]:
ds1 = pd.DataFrame({'a':[1,2,3,4],'b':[6,5,49,8]} ,index=['A','B','C','D'])
ds2 = pd.DataFrame({'c':[1,2,3,4],'d':[6,5,49,8]})
ds1.join(ds2)

   a   b   c   d
A  1   6 NaN NaN
B  2   5 NaN NaN
C  3  49 NaN NaN
D  4   8 NaN NaN

In [18]:
# index name is also same other wise they showing nan value 
ds1 = pd.DataFrame({'a':[1,2,3,4],'b':[6,5,49,8]} ,index=['A','B','C','D'])
ds2 = pd.DataFrame({'c':[1,2], 'd' :[6,5]},index=['A','B'])
ds1.join(ds2)

   a   b    c    d
A  1   6  1.0  6.0
B  2   5  2.0  5.0
C  3  49  NaN  NaN
D  4   8  NaN  NaN

In [19]:
# lsuffix  ='name' change the left column name  
# rsuffix = 'name' change the right column name 
ds1 = pd.DataFrame({'a':[1,2,3,4],'b':[6,5,49,8]})
ds2 = pd.DataFrame({'b':[1,2], 'd' :[6,5]})
ds1.join(ds2,rsuffix='mc',lsuffix='bc')

   a  bbc  bmc    d
0  1    6  1.0  6.0
1  2    5  2.0  5.0
2  3   49  NaN  NaN
3  4    8  NaN  NaN